dir_file = '../Dars 8/'		#sh

A = ["سیب", "انار", "سیر", "دندان", "آبی", 
"دامن", "دیر", "بیدار", "ایمان", "آسیب",
 "بندر", "بینا", "نابینا",  "دید", "دارد",
 "ندارد", "توران", "مینا", "نیما", "امین",
 "نام", "اسباب", "آبان", "سینی", "تبر"
]

D = [
     "درس آسان است.",
     "سارا دندان درد دارد.",
     "روستا بی آب است.",
     "آن نابینا نور را می دید.",
     "توران با تبر آسیب دید."
   ]
def addrs(name):
   return f"Media/{str(name)}.gif"

B = [
     [{'w': "" , 'img' :  addrs(Sib)}],
     [{'w': "ایستادم" , 'img' :  -1},{'w': "من در باران ایستادم." , 'img' : -1}],
     [{'w': "این" , 'img' : -1},{'w': "مادرم این سینی را داد." , 'img' : -1}],
     [{'w': "ایران" , 'img' : -1}],
     [{'w': "بینی" , 'img' :  addrs(Bini)}],
     [{'w': "روسری" , 'img' : addrs(Roosari)}],
     [{'w': "سیم" , 'img' : addrs(Sim)}, {'w': "" , 'img' : addrs(Sim2)}],.
     [{'w':  "دین", 'img' :  -1}],
     [{'w': "" , 'img' :  addrs(Start)}],   	#### Start photo
     [{'w': "شَب" , 'img' : -1}],
     [{'w': "آش" , 'img' : addrs(Aash)}],
     [{'w': "شیر" , 'img' : addrs(Shir)}, {'w': "" , 'img' : addrs(Shir2)}],
     [{'w': "شور" , 'img' : addrs(Shoor)}, {'w': "" , 'img' : addrs(Shoor2)}],     
     [{'w': "ماشین" , 'img' : addrs(Maashin)}],
     [{'w': "شام" , 'img' : -1}],
     [{'w': "تراش" , 'img' : addrs(Taraash)}],
     [{'w': "شیما" , 'img' : -1}, {'w': "شیرین" , 'img' : -1}, {'w': "نوشین" , 'img' : -1}],
     [{'w': "موش" , 'img' : addrs(Moosh)}],
     [{'w': "شاد" , 'img' : addrs(Shaad)}],
     [{'w': "شادباش" , 'img' : -1}, {'w': "شاباش" , 'img' : addrs(Shaabaash)}],
     [{'w': "شمس" , 'img' : addrs(Shams)}, {'w': "شمسی" , 'img' : -1}],
     [{'w': "تشت" , 'img' : addrs(Tasht)}],
     [{'w': "برادر" , 'img' : -1}, {'w': "داداش" , 'img' : -1}],
     [{'w': "نیش" , 'img' : addrs(Nish)}, {'w': "نیشتَر" , 'img' :addrs(Nishtar)}],
     [{'w': "باشم" , 'img' : -1}, {'w': "باشد" , 'img' : -1}],
     [{'w': "بیشتر" , 'img' : -1}]]
     ]
